In [40]:
import pandas as pd
from datetime import datetime
import math

In [55]:
fc_transaction_base = pd.read_csv("C:/Users/acer/Downloads/fc_transaction_base.csv")

In [56]:
fc_transaction_base.head()

,tran_date,account_number,branch,product,lcy_amount,transaction_code,description1,dc_indicator,is_salary
0,09/06/2020,02XYZXYZ10017529992,15.0,SBA,14500.0,CI,ATM WDL /00463701/NABIL\NABIL,withdraw,0.0
1,14/06/2020,02XYZXYZ10017529992,15.0,SBA,20000.0,CI,ATM WDL /00463701/NABIL\NABIL,withdraw,0.0
2,01/06/2020,02XYZXYZ10017517823,15.0,SBA,4000.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0
3,05/06/2020,02XYZXYZ10017517823,15.0,SBA,500.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0
4,12/06/2020,02XYZXYZ10017517823,15.0,SBA,5000.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0

In [57]:
fc_transaction_base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45032 entries, 0 to 45031
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   tran_date         45032 non-null  object
 1   account_number    45031 non-null  object
 2   branch            45031 non-null  float64
 3   product           45031 non-null  object
 4   lcy_amount        45031 non-null  float64
 5   transaction_code  45031 non-null  object
 6   description1      44959 non-null  object
 7   dc_indicator      45030 non-null  object
 8   is_salary         45030 non-null  float64
dtypes: float64(3), object(6)
memory usage: 3.1+ MB

In [58]:
fc_transaction_base = fc_transaction_base[fc_transaction_base['tran_date'].str.match(r'\d{2}/\d{2}/\d{4}')]
fc_transaction_base["tran_date"] =pd.to_datetime(fc_transaction_base["tran_date"],format = '%d/%m/%Y')

In [59]:
fc_transaction_base.describe()

                           tran_date        branch    lcy_amount     is_salary
count                          45031  45031.000000  4.503100e+04  45030.000000
mean   2020-07-10 20:14:25.643667712     16.566099  3.981024e+04      0.068155
min              2020-06-01 00:00:00      1.000000  1.000000e-02      0.000000
25%              2020-06-25 00:00:00     17.000000  9.447350e+02      0.000000
50%              2020-07-14 00:00:00     17.000000  5.000000e+03      0.000000
75%              2020-07-27 00:00:00     18.000000  2.000000e+04      0.000000
max              2020-08-16 00:00:00     49.000000  1.028081e+07      1.000000
std                              NaN      4.144436  2.272606e+05      0.252014

In [60]:
df_recency = fc_transaction_base.groupby('account_number')['tran_date'].max()

In [61]:
df_recency = df_recency.reset_index(name='max_tran_date')

In [62]:
df_recency.head()

        account_number max_tran_date
0  02XYZXYZ10015339701    2020-08-16
1  02XYZXYZ10015571501    2020-08-16
2  02XYZXYZ10015571601    2020-08-16
3  02XYZXYZ10015592101    2020-08-16
4  02XYZXYZ10015593701    2020-08-14

In [63]:
df_recency.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1838 entries, 0 to 1837
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   account_number  1838 non-null   object
 1   max_tran_date   1838 non-null   datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 28.8+ KB

In [75]:
df_recency['Recency'] = df_recency['max_tran_date'].apply(lambda x: math.floor((datetime.now() - x).days))
df_recency.head()

        account_number max_tran_date  Recency
0  02XYZXYZ10015339701    2020-08-16     1355
1  02XYZXYZ10015571501    2020-08-16     1355
2  02XYZXYZ10015571601    2020-08-16     1355
3  02XYZXYZ10015592101    2020-08-16     1355
4  02XYZXYZ10015593701    2020-08-14     1357

In [76]:
df_recency['Recency'].max()

1387

In [77]:
df_recency['Recency'] = df_recency['Recency'].max() - df_recency['Recency']

In [78]:
df_recency.head()

        account_number max_tran_date  Recency
0  02XYZXYZ10015339701    2020-08-16       32
1  02XYZXYZ10015571501    2020-08-16       32
2  02XYZXYZ10015571601    2020-08-16       32
3  02XYZXYZ10015592101    2020-08-16       32
4  02XYZXYZ10015593701    2020-08-14       30

In [65]:
df_frequency = fc_transaction_base.groupby('account_number',as_index=False)['tran_date'].count()

In [67]:
df_frequency.columns = ["account_number","frequency"]

In [68]:
df_frequency.head()

        account_number  frequency
0  02XYZXYZ10015339701         28
1  02XYZXYZ10015571501         29
2  02XYZXYZ10015571601          4
3  02XYZXYZ10015592101         44
4  02XYZXYZ10015593701         21

In [71]:
df_Monetery= fc_transaction_base.groupby('account_number',as_index=False)['lcy_amount'].sum()

In [72]:
df_Monetery.columns = ["account_number","Monetery"]

In [73]:
df_Monetery.head()

        account_number     Monetery
0  02XYZXYZ10015339701   9222574.71
1  02XYZXYZ10015571501   4928227.77
2  02XYZXYZ10015571601     57616.10
3  02XYZXYZ10015592101  11712489.16
4  02XYZXYZ10015593701   4187990.01